Tekla.Structures.ModelInternal.NumberingSeriesNullable
The NumberingSeriesNullable class describes how an object is to be numbered.

Tekla.Structures.ModelInternal.NumberingSeriesNullable.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.NumberingSeriesNullable class.

Tekla.Structures.ModelInternal.NumberingSeriesNullable.#ctor(System.String,System.Int32)
Initializes a new instance of the Tekla.Structures.ModelInternal.NumberingSeriesNullable class with the given arguments.
prefix: The prefix to be used.
number: The start number to be used.

Tekla.Structures.ModelInternal.NumberingSeriesNullable.ToStruct(Tekla.Structures.ModelInternal.dotNumberingSeries_t@)
The to struct.
p: The p.

Tekla.Structures.ModelInternal.NumberingSeriesNullable.FromStruct(Tekla.Structures.ModelInternal.dotNumberingSeries_t@)
The from struct.
p: The p.

Tekla.Structures.ModelInternal.NumberingSeriesNullable.Prefix
Gets or sets the prefix.

Tekla.Structures.ModelInternal.NumberingSeriesNullable.StartNumber
Gets or sets the start number.